[
    {
        "slug": "wudhu",
        "keyword": "wudhu",
        "description_short": "Wudhu adalah salah satu bentuk thaharah (bersuci) dalam Islam untuk mengangkat hadas kecil sebelum melakukan ibadah tertentu seperti sholat.",
        "description_long": "Wudhu adalah syariat bersuci dari hadas kecil yang diwajibkan sebelum melaksanakan ibadah tertentu seperti sholat, thawaf, dan menyentuh mushaf Al-Qur’an. Allah ﷻ berfirman:\n\nيَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا قُمْتُمْ إِلَى الصَّلَاةِ فَاغْسِلُوا وُجُوهَكُمْ وَأَيْدِيَكُمْ إِلَى الْمَرَافِقِ وَامْسَحُوا بِرُءُوسِكُمْ وَأَرْجُلَكُمْ إِلَى الْكَعْبَيْنِ\n\"Wahai orang-orang yang beriman! Apabila kamu hendak melaksanakan sholat, maka basuhlah wajahmu dan tanganmu sampai ke siku, dan sapulah kepalamu dan (basuh) kakimu sampai kedua mata kaki.\" (QS. Al-Ma'idah: 6)\n\nTata cara wudhu telah dicontohkan secara sempurna oleh Rasulullah ﷺ sebagaimana disebutkan dalam hadits-hadits shahih. Di antaranya hadits dari Humran, bekas budak Utsman bin Affan, bahwa Utsman pernah berwudhu dan kemudian berkata, \"Aku melihat Nabi ﷺ berwudhu seperti wudhuku ini,\" (HR. Bukhari dan Muslim).\n\nWudhu memiliki banyak keutamaan, salah satunya disebutkan dalam hadits: \"Barang siapa yang berwudhu dan menyempurnakan wudhunya, maka dosa-dosanya akan keluar dari tubuhnya, bahkan keluar dari bawah kukunya.\" (HR. Muslim).\n\nWudhu juga merupakan cahaya bagi mukmin di hari kiamat. Rasulullah ﷺ bersabda: \"Sesungguhnya umatku akan datang pada hari kiamat dalam keadaan wajah, tangan, dan kaki mereka bercahaya karena bekas wudhu.\" (HR. Bukhari dan Muslim).\n\nDalam kondisi tertentu seperti luka atau sakit, Islam memberikan kemudahan seperti tayamum. Namun selama air tersedia dan tidak membahayakan, wudhu tetap menjadi syarat sah ibadah tertentu."
    },
    {
        "slug": "tayamum",
        "keyword": "tayamum",
        "description_short": "Tayamum adalah pengganti wudhu atau mandi wajib ketika tidak ada air atau tidak memungkinkan menggunakan air.",
        "description_long": "Tayamum merupakan rukhsah (keringanan) dalam Islam yang diberikan kepada hamba-Nya ketika tidak ada air atau tidak memungkinkan menggunakan air karena alasan syar’i seperti sakit. Allah ﷻ berfirman:\n\nفَلَمْ تَجِدُوا مَاءً فَتَيَمَّمُوا صَعِيدًا طَيِّبًا\n\"...dan jika kamu tidak memperoleh air, maka bertayamumlah dengan tanah yang baik (bersih)...\" (QS. Al-Ma’idah: 6)\n\nTayamum dilakukan dengan cara mengusap wajah dan tangan dengan tanah atau debu yang suci. Rasulullah ﷺ bersabda: \"Debu adalah alat bersuci bagi seorang Muslim meskipun dia tidak menemukan air selama sepuluh tahun. Namun jika telah menemukan air, maka basuhlah anggota tubuhnya.\" (HR. Tirmidzi dan Abu Dawud)\n\nTayamum disyariatkan sebagai bentuk kemudahan dan kasih sayang dari ﷻ kepada umat Islam. Hal ini ditegaskan dalam firman-Nya:\n\nيُرِيدُ اللَّهُ بِكُمُ الْيُسْرَ وَلَا يُرِيدُ بِكُمُ الْعُسْرَ\n\"Allah menghendaki kemudahan bagimu, dan tidak menghendaki kesulitan bagimu.\" (QS. Al-Baqarah: 185)\n\nTayamum boleh dilakukan dalam kondisi ketika seseorang sakit parah dan air dapat memperparah keadaannya. Dalam hadits yang diriwayatkan oleh Ibn ‘Abbas, Rasulullah ﷺ bersabda: \"Sesungguhnya cukup bagimu untuk bertayamum saja,\" (HR. Abu Dawud).\n\nTayamum juga menunjukkan fleksibilitas syariat Islam dalam menjaga kemudahan dan kesucian dalam beribadah, tanpa mengabaikan aspek kehati-hatian dan kebersihan."
    },
    {
        "slug": "mandi-wajib",
        "keyword": "mandi wajib",
        "description_short": "Mandi wajib adalah mandi besar untuk menghilangkan hadas besar yang menjadi syarat sahnya ibadah tertentu seperti sholat dan puasa.",
        "description_long": "Mandi wajib atau mandi junub adalah kewajiban bersuci dari hadas besar, seperti setelah berhubungan suami istri, keluarnya mani, haid, dan nifas. Allah ﷻ berfirman:\n\nوَإِن كُنتُمْ جُنُبًا فَاطَّهَّرُوا\n\"Dan jika kamu junub, maka mandilah.\" (QS. Al-Ma’idah: 6)\n\nDalil lain terdapat dalam hadits dari Aisyah radhiyallahu ‘anha bahwa Rasulullah ﷺ biasa mandi janabah dengan menuangkan air sebanyak tiga kali ke atas kepalanya dan menyiram seluruh tubuhnya. (HR. Bukhari dan Muslim)\n\nMandi wajib juga diwajibkan bagi perempuan setelah selesai haid dan nifas. Dalam QS. Al-Baqarah: 222, ﷻ berfirman:\n\nفَإِذَا تَطَهَّرْنَ فَأْتُوهُنَّ مِنْ حَيْثُ أَمَرَكُمُ اللَّهُ\n\"...Maka apabila mereka telah bersuci, maka campurilah mereka sesuai dengan ketentuan yang diperintahkan Allah kepadamu...\"\n\nDalam hadits lain Rasulullah ﷺ bersabda kepada Asma’ binti Syakl: “Salah seorang dari kalian mengambil air dan daun bidara, lalu bersuci dan membersihkan diri sebaik-baiknya, lalu menuangkan air ke kepalanya dan menggosokkannya dengan kuat, lalu mencurahkan air ke seluruh tubuhnya.” (HR. Muslim)\n\nMandi wajib bukan hanya syarat sah ibadah, tapi juga mengandung hikmah kebersihan dan spiritual. Diperintahkan untuk tidak menunda mandi wajib karena hadas besar menghalangi seseorang dari sholat dan membaca Al-Qur’an. Ini menunjukkan pentingnya menjaga kesucian lahir dan batin dalam Islam."
    },
    {
        "slug": "air",
        "keyword": "air",
        "description_short": "Air adalah unsur utama dalam thaharah yang digunakan untuk bersuci dari hadas dan najis dalam syariat Islam.",
        "description_long": "Air memiliki kedudukan penting dalam syariat Islam, khususnya dalam hal bersuci (thaharah). Air yang digunakan untuk bersuci haruslah air yang suci dan mensucikan, seperti air hujan, air sumur, air laut, atau air sungai. Allah ﷻ berfirman:\n\nوَيُنَزِّلُ عَلَيْكُم مِّنَ السَّمَاءِ مَاءً لِّيُطَهِّرَكُم بِهِ\n\"Dan Dia menurunkan kepadamu air dari langit untuk menyucikan kamu dengannya...\" (QS. Al-Anfal: 11)\n\nJenis air dalam fiqih diklasifikasikan menjadi air mutlak (suci dan mensucikan), air musta’mal, air muqayyad, dan air mutanajjis. Hanya air mutlak yang dapat digunakan untuk wudhu, mandi wajib, dan menghilangkan najis. Rasulullah ﷺ bersabda: \"Sesungguhnya air itu suci, tidak ada sesuatu yang dapat menajiskannya.\" (HR. Abu Dawud dan Tirmidzi)\n\nAir juga menjadi simbol keberkahan dan rahmat dari ﷻ. Dalam QS. Al-Furqan: 48, disebutkan:\n\nوَأَنزَلْنَا مِنَ السَّمَاءِ مَاءً طَهُورًا\n\"Dan Kami turunkan dari langit air yang sangat bersih (untuk menyucikan).\"\n\nAir laut juga disyariatkan sebagai air yang suci dan mensucikan. Nabi ﷺ bersabda tentang air laut: \"Airnya suci mensucikan dan bangkainya halal.\" (HR. Abu Dawud dan Tirmidzi)\n\nDengan demikian, air merupakan sarana utama yang ditetapkan oleh syariat dalam menjaga kebersihan fisik dan spiritual umat Islam, dan menjadi prasyarat bagi banyak ibadah utama."
    },
    {
        "slug": "hadast",
        "keyword": "hadast",
        "description_short": "Hadast adalah keadaan tidak suci yang menghalangi seseorang untuk melakukan ibadah tertentu seperti sholat dan membaca Al-Qur'an.",
        "description_long": "Hadast dalam Islam terbagi menjadi dua: hadast kecil dan hadast besar. Hadast kecil mengharuskan wudhu, sedangkan hadast besar mewajibkan mandi besar. Allah ﷻ berfirman:\n\nيَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَقْرَبُوا الصَّلَاةَ وَأَنتُمْ سُكَارَىٰ ... وَلَا جُنُبًا إِلَّا عَابِرِي سَبِيلٍ حَتَّىٰ تَغْتَسِلُوا\n\"Wahai orang-orang yang beriman, janganlah kamu mendekati shalat sedang kamu dalam keadaan mabuk... dan jangan (pula) dalam keadaan junub, kecuali sekadar berlalu saja, hingga kamu mandi.\" (QS. An-Nisa: 43)\n\nContoh hadast kecil adalah buang air kecil, buang air besar, kentut, tidur nyenyak, dan hilangnya akal. Sedangkan hadast besar mencakup keluar mani, haid, nifas, dan berhubungan suami istri.\n\nRasulullah ﷺ bersabda: \"Tidak diterima sholat tanpa bersuci.\" (HR. Muslim). Ini menunjukkan bahwa bersuci dari hadast adalah syarat sahnya sholat dan beberapa ibadah lainnya seperti thawaf dan menyentuh mushaf.\n\nIslam memudahkan umatnya dalam bersuci. Jika tidak ditemukan air atau air membahayakan kesehatan, maka diperbolehkan tayamum sebagai pengganti. Hal ini menandakan bahwa hadast adalah hal serius, namun syariat memberi solusi praktis.\n\nMengetahui dan memahami kondisi hadast penting bagi setiap Muslim agar ibadah yang dilakukan sah secara syar’i. Bersuci dari hadast adalah bagian dari kesucian lahir dan batin yang menjadi ciri utama hamba yang dicintai oleh Allah ﷻ."
    },
    {
        "slug": "najis",
        "keyword": "najis",
        "description_short": "Najis adalah benda atau keadaan yang dianggap kotor dalam Islam dan harus disucikan untuk menjaga kesucian ibadah.",
        "description_long": "Najis adalah segala sesuatu yang dianggap kotor oleh syariat Islam dan menyebabkan tidak sahnya ibadah jika tidak disucikan. Najis terbagi menjadi najis ringan (mukhaffafah), najis sedang (mutawassitah), dan najis berat (mughallazhah). Dalam QS. Al-Baqarah: 222, Allah ﷻ berfirman:\n\nإِنَّ اللَّهَ يُحِبُّ التَّوَّابِينَ وَيُحِبُّ الْمُتَطَهِّرِينَ\n\"Sesungguhnya Allah mencintai orang-orang yang bertaubat dan mencintai orang-orang yang menyucikan diri.\"\n\nContoh najis ringan adalah air kencing bayi laki-laki yang belum makan makanan selain ASI. Najis sedang mencakup darah, muntah, kotoran manusia atau hewan, dan sejenisnya. Najis berat adalah seperti air kencing dan kotoran anjing serta liurnya, yang harus disucikan dengan air sebanyak tujuh kali dan salah satunya dengan tanah, sebagaimana sabda Nabi ﷺ: \"Sucinya bejana salah seorang di antara kalian apabila dijilat anjing adalah dengan membasuhnya tujuh kali, salah satunya dengan tanah.\" (HR. Muslim)\n\nPembersihan najis wajib dilakukan sebelum melaksanakan sholat, karena pakaian, badan, dan tempat harus dalam keadaan suci. Rasulullah ﷺ pernah menegur seorang wanita yang beristihadhah dan bersabda: \"Basuhlah darah itu dan sholatlah.\" (HR. Bukhari)\n\nIslam memperhatikan kebersihan lahiriah karena itu berpengaruh pada kesucian ibadah. Bahkan dalam hadits lain, Rasulullah ﷺ bersabda: \"Kebersihan adalah sebagian dari iman.\" (HR. Muslim)\n\nMengetahui jenis najis dan cara menyucikannya adalah bagian dari ilmu yang penting bagi setiap Muslim agar ibadahnya sah dan diterima oleh Allah ﷻ."
    },
    {
        "slug": "istinja",
        "keyword": "istinja",
        "description_short": "Istinja adalah perbuatan bersuci setelah buang air kecil atau besar dengan menggunakan air untuk menghilangkan najis.",
        "description_long": "Istinja merupakan bagian dari thaharah yang berarti membersihkan najis yang keluar dari qubul dan dubur dengan air. Ini merupakan sunnah yang sangat dianjurkan dan menjadi wajib apabila najis masih melekat. Rasulullah ﷺ bersabda: \"Apabila salah seorang dari kalian pergi ke toilet, maka hendaklah ia beristinja dengan tiga batu, dan itu cukup baginya.\" (HR. Abu Dawud dan Ahmad)\n\nNamun yang lebih utama adalah menggunakan air, sebagaimana dilakukan oleh Nabi ﷺ. Dalam sebuah hadits, Anas bin Malik berkata: \"Apabila Rasulullah ﷺ keluar untuk buang hajat, aku dan seorang anak seusia aku membawakannya air dalam bejana dan tongkat. Beliau beristinja dengan air.\" (HR. Bukhari dan Muslim)\n\nAllah ﷻ berfirman:\n\nفِيهِ رِجَالٌ يُحِبُّونَ أَن يَتَطَهَّرُوا ۚ وَاللَّهُ يُحِبُّ الْمُطَّهِّرِينَ\n\"Di dalamnya terdapat orang-orang yang suka membersihkan diri. Dan Allah menyukai orang-orang yang bersih.\" (QS. At-Taubah: 108)\n\nIstinja juga memiliki dampak spiritual, karena ia termasuk bentuk penjagaan kebersihan yang dicintai oleh ﷻ. Bahkan dalam hadits disebutkan bahwa kebanyakan azab kubur disebabkan karena tidak menjaga diri dari air kencing. (HR. Bukhari)\n\nDengan demikian, istinja adalah syariat yang mengajarkan kebersihan pribadi sekaligus spiritualitas seorang Muslim dalam menjalani kehidupan sehari-hari."
    },
    {
        "slug": "istijmar",
        "keyword": "istijmar",
        "description_short": "Istijmar adalah bersuci dari najis buang air kecil atau besar dengan menggunakan benda padat yang suci, seperti batu atau tisu.",
        "description_long": "Istijmar merupakan alternatif dari istinja dalam bersuci setelah buang hajat, dengan menggunakan benda padat seperti batu, tisu, atau benda lainnya yang suci dan dapat menghilangkan najis. Ini adalah bentuk kemudahan dalam Islam. Rasulullah ﷺ bersabda: \"Jika salah seorang dari kalian pergi ke toilet, hendaklah ia beristijmar dengan tiga batu.\" (HR. Abu Dawud dan Tirmidzi)\n\nMeski menggunakan air lebih utama, istijmar tetap sah selama najis benar-benar bersih. Dalam hadits disebutkan: \"Apabila salah seorang dari kalian pergi buang air, maka hendaklah ia membawa tiga batu untuk beristijmar. Itu cukup baginya.\" (HR. Ahmad dan Abu Dawud)\n\nSyarat istijmar adalah benda tersebut harus suci, tidak najis, tidak melukai, dan tidak merupakan makanan manusia atau hewan. Rasulullah ﷺ melarang bersuci dengan tulang dan kotoran hewan. (HR. Bukhari)\n\nDalam keadaan darurat atau sulit mendapatkan air, istijmar adalah solusi praktis dan tetap sah menurut syariat. Namun apabila najis belum hilang, maka wajib dilanjutkan dengan air.\n\nIstijmar menunjukkan bahwa Islam sangat memperhatikan kebersihan dengan tetap mempertimbangkan kondisi dan kemudahan bagi umatnya, menjadikan syariat ini fleksibel namun tetap menjaga kesucian."
    },
    {
        "slug": "khuf",
        "keyword": "khuf",
        "description_short": "Khuf adalah sepatu atau kaus kaki kulit yang dibolehkan untuk diusap dalam wudhu sebagai keringanan dalam syariat.",
        "description_long": "Khuf adalah alas kaki dari kulit atau bahan lainnya yang menutupi mata kaki, dan boleh diusap saat wudhu sebagai pengganti membasuh kaki. Ini merupakan rukhsah (keringanan) yang disyariatkan oleh Islam. Rasulullah ﷺ bersabda: \"Sesungguhnya Allah memberikan keringanan kepada umatku untuk mengusap khuf dalam keadaan safar selama tiga hari tiga malam, dan sehari semalam bagi yang mukim.\" (HR. Muslim)\n\nSyarat bolehnya mengusap khuf adalah dipakai dalam keadaan suci setelah wudhu, dan tidak dilepas selama masa rukhsah berlaku. Dalam hadits dari Ali bin Abi Thalib disebutkan: \"Seandainya agama ini berdasarkan logika semata, tentu bagian bawah khuf lebih layak diusap daripada bagian atas. Tetapi aku melihat Rasulullah ﷺ mengusap bagian atasnya.\" (HR. Abu Dawud)\n\nWaktu rukhsah bagi mukim adalah satu hari satu malam (24 jam), dan bagi musafir tiga hari tiga malam (72 jam). Penghitungan dimulai dari saat pertama kali mengusap, bukan dari saat pertama kali memakai khuf.\n\nMengusap khuf memudahkan banyak orang dalam menjaga wudhu, khususnya saat berada dalam perjalanan atau cuaca dingin. Ini menunjukkan fleksibilitas Islam dalam menjaga ibadah tanpa memberatkan.\n\nJika khuf dilepas atau terkena najis, maka wudhu menjadi batal dan harus diulang dengan membasuh kaki seperti biasa. Penggunaan khuf dengan hukum dan syaratnya adalah bagian dari fiqih thaharah yang penting diketahui oleh setiap Muslim."
    },
    {
        "slug": "haidh",
        "keyword": "haidh",
        "description_short": "Haidh adalah darah alami yang keluar dari rahim wanita secara berkala sebagai bagian dari fitrah penciptaan.",
        "description_long": "Haidh adalah darah yang keluar dari rahim wanita secara alami dan berkala setiap bulan, biasanya berlangsung antara 6 hingga 15 hari. Haidh merupakan kondisi yang memiliki pengaruh langsung terhadap sah atau tidaknya ibadah tertentu. Allah ﷻ berfirman:\n\nوَيَسْأَلُونَكَ عَنِ الْمَحِيضِ ۖ قُلْ هُوَ أَذًى فَاعْتَزِلُوا النِّسَاءَ فِي الْمَحِيضِ\n\"Mereka bertanya kepadamu tentang haidh. Katakanlah: Haidh itu adalah suatu kotoran. Oleh sebab itu hendaklah kamu menjauhkan diri dari wanita di waktu haidh.\" (QS. Al-Baqarah: 222)\n\nWanita yang sedang haidh dilarang melakukan sholat, puasa, thawaf, dan menyentuh mushaf Al-Qur’an. Dalam hadits, Rasulullah ﷺ bersabda: \"Bukankah apabila haidh, dia tidak sholat dan tidak puasa?\" (HR. Bukhari)\n\nNamun, wanita haidh tetap mendapatkan pahala niat dalam beribadah dan diperintahkan untuk mengganti puasa setelah Ramadhan, tetapi tidak mengganti sholat. Hal ini merupakan bentuk kemudahan dari syariat.\n\nSetelah haidh berhenti dan keluar tanda suci, wanita wajib mandi besar (ghusl) sebelum kembali menjalankan ibadah. Rasulullah ﷺ bersabda: \"Apabila datang haidh, maka tinggalkan sholat. Dan apabila telah berhenti, maka mandilah dan sholatlah.\" (HR. Bukhari)\n\nMengetahui hukum dan batasan haidh penting bagi wanita Muslimah agar dapat menjaga ibadah sesuai dengan syariat, serta memahami bahwa haidh bukan hal najis secara mutlak, tetapi kondisi fitrah yang diatur secara khusus dalam hukum Islam."
    },
    {
        "slug": "niat",
        "keyword": "niat",
        "description_short": "Niat adalah tekad dalam hati untuk melakukan suatu ibadah karena Allah ﷻ, dan menjadi syarat sahnya ibadah.",
        "description_long": "Niat adalah amalan hati yang menentukan keabsahan suatu ibadah. Semua ibadah dalam Islam bergantung pada niat. Rasulullah ﷺ bersabda:\n\nإِنَّمَا الأَعْمَالُ بِالنِّيَّاتِ، وَإِنَّمَا لِكُلِّ امْرِئٍ مَا نَوَى\n\"Sesungguhnya setiap amal tergantung pada niatnya, dan sesungguhnya setiap orang akan mendapatkan sesuai dengan apa yang ia niatkan.\" (HR. Bukhari dan Muslim)\n\nNiat tidak perlu diucapkan dengan lisan karena tempatnya adalah di hati. Dalam sholat, puasa, zakat, haji, bahkan bersuci seperti wudhu dan mandi wajib—semua sah atau tidaknya bergantung pada niat.\n\nAllah ﷻ berfirman:\n\nوَمَا أُمِرُوا إِلَّا لِيَعْبُدُوا اللَّهَ مُخْلِصِينَ لَهُ الدِّينَ\n\"Padahal mereka tidak diperintah kecuali supaya menyembah Allah dengan memurnikan ketaatan kepada-Nya dalam (menjalankan) agama...\" (QS. Al-Bayyinah: 5)\n\nNiat juga menjadi pembeda antara ibadah wajib dan sunnah, atau antara ibadah dengan kebiasaan. Seseorang bisa makan dengan niat menguatkan badan untuk ibadah dan mendapat pahala, atau sekadar mengisi perut.\n\nMemperbaiki niat adalah bagian dari memperbaiki keikhlasan. Niat yang benar menjadikan ibadah diterima oleh ﷻ, sedangkan niat karena riya’ (pamer) akan meniadakan pahala meskipun amalnya tampak besar di mata manusia."
    },
    {
        "slug": "fardhu-wudhu",
        "keyword": "fardhu wudhu",
        "description_short": "Fardhu wudhu adalah bagian-bagian yang wajib dilakukan dalam wudhu agar sah menurut syariat Islam.",
        "description_long": "Fardhu wudhu adalah rukun-rukun yang wajib dipenuhi dalam wudhu. Jika salah satu darinya ditinggalkan, maka wudhu dianggap tidak sah. Hal ini dijelaskan dalam Al-Qur’an:\n\nيَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا قُمْتُمْ إِلَى الصَّلَاةِ فَاغْسِلُوا وُجُوهَكُمْ وَأَيْدِيَكُمْ إِلَى الْمَرَافِقِ وَامْسَحُوا بِرُءُوسِكُمْ وَأَرْجُلَكُمْ إِلَى الْكَعْبَيْنِ\n\"Wahai orang-orang yang beriman! Apabila kamu hendak melaksanakan sholat, maka basuhlah wajahmu, dan tanganmu sampai siku, sapulah kepalamu, dan (basuhlah) kakimu sampai kedua mata kaki.\" (QS. Al-Ma’idah: 6)\n\nDari ayat tersebut dan penjelasan hadits, para ulama menyimpulkan fardhu wudhu ada enam: (1) niat, (2) membasuh wajah, (3) membasuh kedua tangan hingga siku, (4) mengusap sebagian kepala, (5) membasuh kedua kaki sampai mata kaki, (6) tertib atau urut sesuai urutan syariat.\n\nRasulullah ﷺ bersabda: \"Tidak diterima sholat seseorang jika ia tidak berwudhu, dan tidak diterima wudhunya jika tidak menyebut nama Allah.\" (HR. Abu Dawud, meskipun tasmiyah statusnya sunnah menurut mayoritas ulama)\n\nSelain fardhu, wudhu juga memiliki sunnah-sunnah seperti berkumur, menghirup air ke hidung, mendahulukan anggota kanan, dan memperbanyak basuhan.\n\nMengetahui fardhu wudhu penting agar ibadah sholat dan lainnya yang bergantung pada kesucian diterima oleh Allah ﷻ. Wudhu yang sah menjadi pintu masuk kepada keabsahan berbagai ibadah lainnya."
    },
    {
        "slug": "sunnah-wudhu",
        "keyword": "sunnah wudhu",
        "description_short": "Sunnah wudhu adalah amalan-amalan yang dianjurkan saat berwudhu, namun tidak wajib, dan dapat menambah kesempurnaan ibadah.",
        "description_long": "Sunnah wudhu adalah bagian dari adab dan amalan tambahan yang dianjurkan dalam berwudhu. Meskipun tidak wajib, mengamalkannya menunjukkan kesempurnaan ibadah dan kecintaan pada sunnah Rasulullah ﷺ. Dalam sebuah hadits, Nabi ﷺ bersabda: \"Barang siapa yang berwudhu dan menyempurnakan wudhunya, maka dosa-dosanya keluar dari tubuhnya hingga keluar dari bawah kuku-kukunya.\" (HR. Muslim)\n\nBeberapa sunnah wudhu yang diajarkan oleh Rasulullah ﷺ antara lain: membaca basmalah di awal, mencuci kedua telapak tangan tiga kali, berkumur, menghirup dan mengeluarkan air dari hidung (istinsyaq dan istintsar), menyela-nyela jari tangan dan kaki, mendahulukan anggota kanan, dan memperbanyak basuhan hingga tiga kali.\n\nDalil tentang berkumur dan istinsyaq diriwayatkan dari Abdullah bin Zaid: \"Rasulullah ﷺ berkumur dan menghirup air ke hidung dengan satu genggaman tangan, dan beliau melakukan itu tiga kali.\" (HR. Bukhari dan Muslim)\n\nRasulullah ﷺ juga bersabda: \"Sempurnakanlah wudhu kalian, celakalah tumit-tumit yang tidak terkena air (saat wudhu).\" (HR. Bukhari dan Muslim). Ini menunjukkan pentingnya perhatian terhadap kesempurnaan wudhu, termasuk dengan menjalankan sunnah-sunnahnya.\n\nMengamalkan sunnah wudhu bukan hanya menambah pahala, tetapi juga menunjukkan semangat dalam meneladani Nabi ﷺ dan meningkatkan kualitas ibadah yang dilakukan setelahnya, seperti sholat."
    },
    {
        "slug": "pembatal-wudhu",
        "keyword": "pembatal wudhu",
        "description_short": "Pembatal wudhu adalah hal-hal yang menyebabkan hadas kecil dan mewajibkan seseorang untuk berwudhu kembali sebelum ibadah tertentu.",
        "description_long": "Pembatal wudhu adalah segala hal yang menyebabkan seseorang berada dalam keadaan tidak suci dari hadas kecil sehingga tidak sah melaksanakan ibadah tertentu seperti sholat. Allah ﷻ berfirman:\n\nأَوْ جَاءَ أَحَدٌ مِّنكُم مِّنَ الْغَائِطِ أَوْ لَامَسْتُمُ النِّسَاءَ فَلَمْ تَجِدُوا مَاءً فَتَيَمَّمُوا صَعِيدًا طَيِّبًا\n\"...Atau salah seorang dari kamu datang dari tempat buang air (kecil/besar), atau kamu menyentuh wanita, lalu kamu tidak mendapatkan air, maka bertayamumlah...\" (QS. Al-Ma’idah: 6)\n\nPara ulama menjelaskan bahwa yang termasuk pembatal wudhu antara lain: (1) keluarnya sesuatu dari dua jalan (qubul dan dubur), seperti kencing, buang air besar, kentut; (2) hilangnya akal karena tidur nyenyak, mabuk, atau pingsan; (3) bersentuhan kulit laki-laki dan perempuan non-mahram menurut sebagian ulama; (4) menyentuh kemaluan dengan telapak tangan menurut hadits: \"Barang siapa yang menyentuh kemaluannya, maka hendaklah ia berwudhu.\" (HR. Abu Dawud dan Tirmidzi)\n\nDalam hadits lain, Rasulullah ﷺ bersabda: \"Apabila salah seorang di antara kalian kentut dalam sholatnya, maka hendaklah ia keluar dan berwudhu kembali, lalu ulangi sholatnya.\" (HR. Abu Dawud)\n\nMengetahui pembatal wudhu sangat penting agar ibadah seseorang tetap sah. Karena tanpa wudhu yang valid, sholat dan ibadah lain yang mensyaratkan thaharah menjadi batal.\n\nIslam memberikan penjelasan rinci agar umatnya senantiasa menjaga kesucian dan kedisiplinan dalam ibadah. Karenanya, menjaga wudhu adalah bagian dari menjaga hubungan dengan ﷻ."
    }
]